app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    account_sid = 'AC6650453086e3f6940bf702113274bcbe'
    auth_token = 'bdae3003953d3658634b3bbec9e9e705'
    if @message.save
---
INSERT INTO "messages" ("to", "from", "body") VALUES ($1, $2, $3) RETURNING "id"  [["to", "714-323-3538"], ["from", "714-323-3538"], ["body", "Hello"]]