app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def new
    @products = Product.all

INSERT INTO "products" ("name", "description", "price", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @product = current_user.products.new(product_params)
     if @product.save